# Shivam Bhardwaj-237

In [1]:
import numpy as np
import pandas  as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv("Employee.csv")

In [3]:
df.head()

   Company   Age  Salary     Place Country  Gender
0      TCS  20.0     NaN   Chennai   India       0
1  Infosys  30.0     NaN    Mumbai   India       0
2      TCS  35.0  2300.0  Calcutta   India       0
3  Infosys  40.0  3000.0     Delhi   India       0
4      TCS  23.0  4000.0    Mumbai   India       0

In [6]:
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148 entries, 0 to 147
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Company  140 non-null    object
 1   Age      130 non-null    float64
 2   Salary   124 non-null    float64
 3   Place    134 non-null    object
 4   Country  148 non-null    object
 5   Gender   148 non-null    int64
dtypes: float64(2), int64(1), object(3)
memory usage: 7.1+ KB

              Age       Salary      Gender
count  130.000000   124.000000  148.000000
mean    30.484615  5312.467742    0.222973
std     11.096640  2573.764683    0.417654
min      0.000000  1089.000000    0.000000
25%     22.000000  3030.000000    0.000000
50%     32.500000  5000.000000    0.000000
75%     37.750000  8000.000000    0.000000
max     54.000000  9876.000000    1.000000

In [7]:
df.isnull().sum()

Company     8
Age        18
Salary     24
Place      14
Country     0
Gender      0
dtype: int64

In [12]:
# Age ka mean nikal rahe hain
age_mean = df['Age'].mean()

# Missing Age ko mean se fill karke wapas column me assign
df['Age'] = df['Age'].fillna(age_mean)

In [16]:
# Salary ka median nikal rahe hain (outliers ke liye better)
salary_median = df['Salary'].median()

# Missing salary ko median se fill
df['Salary']=df['Salary'].fillna(salary_median)

In [17]:
# Categorical columns identify kar rahe hain
cat_cols = df.select_dtypes(include='object').columns
cat_cols

Index(['Company', 'Place', 'Country'], dtype='object')

In [24]:
from sklearn.preprocessing import LabelEncoder

# Har categorical column pe label encoding
le = LabelEncoder()

for col in cat_cols:
    df[col] = le.fit_transform(df[col])

In [25]:
df.head()

   Company   Age  Salary  Place  Country  Gender
0        4  20.0  5000.0      2        0       0
1        2  30.0  5000.0      6        0       0
2        4  35.0  2300.0      1        0       0
3        2  40.0  3000.0      4        0       0
4        4  23.0  4000.0      6        0       0

In [26]:
df.drop('Country', axis=1, inplace=True)

In [27]:
df.head()

   Company   Age  Salary  Place  Gender
0        4  20.0  5000.0      2       0
1        2  30.0  5000.0      6       0
2        4  35.0  2300.0      1       0
3        2  40.0  3000.0      4       0
4        4  23.0  4000.0      6       0